[
  {
    "role": "Programador Full-Stack Sênior",
    "company": "Funcional Health Tech · Tempo integral",
    "jobStartDate": "Abr de 2021",
    "jobEndDate": "o momento",
    "location": "Ribeirão Preto, São Paulo, Brasil",
    "description": [
      {
        "topic": "Atuo como facilitador em reuniões de refinamento, contribuindo de maneira significativa para a definição de soluções eficazes."
      },
      {
        "topic": "Ofereço suporte técnico sólido e compartilho meu conhecimento a respeito de processos, enriquecendo as discussões."
      },
      {
        "topic": "Assumo a gestão da qualidade do código, implementando e liderando práticas de code review que promovem padrões elevados."
      },
      {
        "topic": "Destaco e promovo as melhores práticas adotadas pela empresa, consolidando uma cultura de excelência técnica."
      },
      {
        "topic": "Exerço liderança em reuniões de reabastecimento, comunicando de maneira clara e detalhada os objetivos das mudanças propostas."
      },
      {
        "topic": "Demonstro domínio em tecnologias essenciais, incluindo Laravel, PHP, Node.js, Nestjs, microserviços, soluções cloud, graphql, entre outras."
      },
      {
        "topic": "Utilizo meu conhecimento técnico para conceber e implementar soluções robustas e inovadoras, alinhadas com as expectativas da empresa e as necessidades dos clientes."
      },
      {
        "topic": "Mantenho um compromisso contínuo com o desenvolvimento profissional, buscando constantemente aprimorar minhas habilidades técnicas."
      },
      {
        "topic": "Estou sempre atualizado e aplico as últimas tendências tecnológicas relevantes para a nossa área de atuação."
      },
      {
        "topic": "Colaboro de maneira excepcional com membros da equipe e outros departamentos, contribuindo para um ambiente de trabalho positivo e produtivo."
      },
      {
        "topic": "Compartilho proativamente meu conhecimento e experiência, desempenhando um papel ativo no crescimento coletivo da equipe."
      },
      {
        "topic": "Mantenho uma documentação abrangente e precisa sobre soluções implementadas, facilitando a compreensão e manutenção eficiente do código"
      }
    ]
  },
  {
    "role": "Programador fullstack pleno",
    "company": "Etus · Tempo integral",
    "jobStartDate": "jul de 2020",
    "jobEndDate": "abr de 2021",
    "location": "Ribeirão Preto, São Paulo, Brasil",
    "description": [
      {
        "topic": "Participei ativamente no desenvolvimento de APIs com foco em redes sociais."
      },
      {
        "topic": "Adquiri um conhecimento abrangente neste campo, mantendo acesso constante à documentação das APIs dessas redes."
      },
      {
        "topic": "Meu objetivo principal era desenvolver e manter APIs conectadas às redes sociais."
      },
      {
        "topic": "Padronizei os dados para integrá-los ao sistema SaaS mantido pela empresa."
      },
      {
        "topic": "Contribuí para o desenvolvimento de um sistema SaaS que permitia a publicação de posts agendados."
      },
      {
        "topic": "Facilitei a extração de relatórios das atividades nas redes sociais dos usuários."
      },
      {
        "topic": "Trabalhei proficientemente com PHP, Laravel 5, Laravel 7, Laravel 8, HTML, CSS, JavaScript, jQuery e VueJS."
      },
      {
        "topic": "Estas tecnologias foram essenciais para construir soluções sólidas e eficientes na interseção entre redes sociais e o sistema SaaS da empresa."
      }
    ]
  },
  {
    "role": "Programador Pleno",
    "company": "Cohros - Tecnologia e Métodos de Gestão de Pessoas · Tempo integral",
    "jobStartDate": "abr de 2020",
    "jobEndDate": "jul de 2020",
    "location": "Ribeirão Preto, São Paulo, Brasil",
    "description": [
      {
        "topic": "Dediquei-me à manutenção contínua de um sistema SaaS focado em atender às necessidades de gestão de Recursos Humanos."
      },
      {
        "topic": "Coloquei especial ênfase na melhoria da usabilidade, proporcionando uma experiência mais intuitiva para os usuários."
      },
      {
        "topic": "Responsável pela implementação e otimização de funcionalidades utilizando PHP, Laravel 5, MySQL, JavaScript, CSS, HTML, jQuery e VueJS."
      },
      {
        "topic": "Garanti um ambiente coeso e eficiente no sistema, proporcionando aos usuários uma experiência integrada e eficaz."
      },
      {
        "topic": "Trabalhei para assegurar que os usuários desfrutassem de uma experiência intuitiva ao utilizar o sistema."
      },
      {
        "topic": "FaDemonstrada proficiência em PHP, Laravel 5, MySQL, JavaScript, CSS, HTML, jQuery e VueJS."
      }
    ]
  },
  {
    "role": "Analista de sistemas",
    "company": "Nestlé Business Services (NBS Ribeirão Preto)",
    "jobStartDate": "set de 2016",
    "jobEndDate": "mar de 2020",
    "location": "Ribeirão Preto, São Paulo, Brasil",
    "description": [
      {
        "topic": "Desempenhei um papel fundamental no desenvolvimento de sistemas internos para os setores administrativos da empresa."
      },
      {
        "topic": "Participei ativamente em projetos abrangendo diversas áreas, como Recursos Humanos, Contas a pagar, Contas a receber, Registro para Relatório, entre outros."
      },
      {
        "topic": "Destaco minha expertise em automação de processos por meio da linguagem AutoHotKey."
      },
      {
        "topic": "Proporcionei eficiência e agilidade em diversas operações, contribuindo para a otimização do fluxo de trabalho."
      },
      {
        "topic": "Adquiri conhecimento aprofundado em pelo menos um destaque de cada área dos processos administrativos, enriquecendo minha carreira profissional."
      },
      {
        "topic": "Assumi um papel crucial no levantamento de requisitos e na definição de escopo para os projetos desenvolvidos."
      },
      {
        "topic": "Contribuí significativamente para aprimorar minhas habilidades em condução de reuniões, análise de requisitos e estruturação de processos."
      },
      {
        "topic": "Trabalhei com PHP, MySQL, SQL Server, JavaScript, jQuery, AutoHotKey, HTML e CSS."
      },
      {
        "topic": "Demonstrada versatilidade e domínio em múltiplas tecnologias, proporcionando soluções robustas e eficazes nos projetos."
      }
    ]
  },
  {
    "role": "Analista de sistemas",
    "company": "gcn comunicação · Tempo integral",
    "jobStartDate": "fev de 2015",
    "jobEndDate": "set de 2016",
    "location": "Franca, São Paulo, Brasil",
    "description": [
      {
        "topic": "Desempenhei um papel crucial na manutenção do portal de notícias da GCN, uma empresa de comunicação abrangendo jornais, canais de rádio e um portal online."
      },
      {
        "topic": "Foco dedicado em otimizar a performance do portal para lidar com múltiplas conexões de usuários simultâneas."
      },
      {
        "topic": "Participei integralmente no desenvolvimento de um portal de notícias curiosas, desde o início até a implementação final."
      },
      {
        "topic": "Essa experiência abrangente aprimorou não apenas minhas habilidades técnicas, mas também contribuiu significativamente para meu crescimento profissional."
      },
      {
        "topic": "Utilizei diversas tecnologias, incluindo PHP, MySQL, jQuery, JavaScript, AngularJS, CSS e HTML."
      },
      {
        "topic": "Demonstrada versatilidade e domínio em várias stacks, enriquecendo meu repertório profissional."
      },
      {
        "topic": "As experiências adquiridas capacitaram-me a enfrentar desafios complexos no campo do desenvolvimento FullStack."
      },
      {
        "topic": "Demonstrei habilidade em lidar com situações exigentes e buscar soluções eficazes."
      }
    ]
  }
]
